bucketlist-backend/app/controllers/lists_controller.rb

  def create
    @list = List.new(list_params)

    if @list.save
---
INSERT INTO "lists" ("description", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "France"], ["completed", 1], ["created_at", "2023-01-18 21:10:40.389828"], ["updated_at", "2023-01-18 21:10:40.389828"]]

    def set_list
      @list = List.find(params[:id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]